<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Path to the "hot" file
    |--------------------------------------------------------------------------
    | Used in development. In production it won't be used.
    */
    'hot_file' => public_path('hot'),

    /*
    |--------------------------------------------------------------------------
    | Build directory (relative to public_path)
    |--------------------------------------------------------------------------
    */
    'build_path' => 'build',

    /*
    |--------------------------------------------------------------------------
    | Manifest file path
    |--------------------------------------------------------------------------
    | Vite 5/7 پیش‌فرض manifest را داخل ".vite/manifest.json" می‌گذارد.
    */
    'manifest' => public_path('build/manifest.json'),
];
